# Solid Utils Methods

Source: https://www.revitapidocs.com/2026/584a95c7-465c-5e80-844a-282300be3c02.htm

---

| Solid Utils Methods |
| --- |

The SolidUtils type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a new Solid which is a copy of the input Solid. |
|  | ComputeIsGeometricallyClosed | Computes whether the input Solid is geometrically closed to within Revit's tolerances. |
|  | ComputeIsTopologicallyClosed | Compute whether the input Solid is topologically closed. |
|  | CreateTransformed | Creates a new Solid which is the transformation of the input Solid. |
|  | FindAllEdgeEndPointsAtVertex | Find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint. |
|  | IsValidForTessellation | Tests if the input solid or shell is valid for tessellation. |
|  | SplitVolumes | Splits a solid geometry into several separate solids. |
|  | TessellateSolidOrShell | This function facets (i.e., triangulates) a solid or an open shell. Each boundary  component of the solid or shell is represented by a single triangulated structure. |

Top See Also

#### Reference

SolidUtils Class Autodesk.Revit.DB Namespace